{"student": ["hey! so um, I'm kinda lost with this tbh.\ni get that ABC is a right triangle with the right angle at A, and AC is 6 cm and BC is 12 cm. \nI think I need to find CA's length next using Pythagoras... or wait, maybe not? The problem's asking for d(C, AB), that's like the perpendicular distance from C to AB, right? idk how to start with that. 😅", "Ohh, i think I get what ur saying. Since AB is the hypotenuse and A is the right angle, the distance from C to AB would actually just be the line segment AC?? Because it's already perpendicular. 😮 So that means d(C, AB) is just AC which is 6 cm. Is that right??", "ohhh okay, for d(B, AC) that’s like from B perpendicular to AC right?? We still got that right angle at A. So I think for this i need to use the area formula or smth cuz the distance from B to AC would be the height if I imagine the triangle on its side???\n\nlike Area = 1/2 * base * height, and in this case the base is AC, so the Area = 1/2 * AC * d(B, AC). I already know that AC is 6cm, so now I just need to find the area of the triangle. Am I doing this right? Can I use pythagorean theorem to find AB and then use that to find the area?", "Sure thing! So if we're using the Pythagorean theorem that's $AB^2 = AC^2 + BC^2$, since AB is the hypotenuse. I've got $AC = 6$ cm and $BC = 12$ cm. \nLet's do the math: $AB^2 = 6^2 + 12^2$ which is $AB^2 = 36 + 144 = 180$. So $AB$ is the square root of 180, which simplifies to $AB = 6\\sqrt{3}$ times 2, or $AB = 12\\sqrt{3}$ cm.\n\nOkay, so now I can use the area formula. But wait, do I really need to calculate the area? We found $d(C, AB) = 6$ cm already, and isn't the area also just $\\frac{1}{2} \\cdot BC \\cdot d(C, AB)$?\n\nIf I use that, I get area $A = \\frac{1}{2} \\cdot 12 \\cdot 6 = 36$ cm$^2$. That's the same for any formula for the area right? So maybe I can use that and the 6 cm base to find the height, which is what I'm looking for, $d(B, AC)$.", "Okay, so if we plug in the area and AC into the formula to find the $d(B, AC)$, we have:\n\n$36 = \\frac{1}{2} * 6 * d(B, AC)$\n\nSo, if I multiply both sides by 2 to get rid of the fraction, it'll be $72 = 6 * d(B, AC)$. And then I divide both sides by 6 to solve for $d(B, AC)$, so:\n\n$d(B, AC) = 72 / 6$\n$d(B, AC) = 12$.\n\nWait, that seems too simple. Oh no, I think I got it wrong. It should actually be something with a square root of 3, right? lemme try again... \n\n$36 = \\frac{1}{2} \\cdot 6 \\cdot d(B, AC)$\n$72 = 6 \\cdot d(B, AC)$\n$d(B, AC) = \\frac{72}{6}$\n$d(B, AC) = 12$.\n\nOh wait, that's the same thing I got. Umm am I missing something? They said it's supposed to be $6\\sqrt{3}$ 😵", "Oooops my bad 😅. I totally went too fast there. Okay, let's do this properly.\n\nSo we've got $AB^2 = 180$ which means $AB = \\sqrt{180}$. I know 180 is like $36 \\times 5$ and the square root of 36 is 6.\n\nSo, $\\sqrt{180} = \\sqrt{36 \\times 5} = \\sqrt{36} \\times \\sqrt{5} = 6\\sqrt{5}$. Woops, still not the $\\sqrt{3}$ thing. Lemme try that again...\n\nI know $\\sqrt{9} = 3$ is also in there somewhere, and 180 is $9 \\times 20$.\n\nSo now we got $\\sqrt{180} = \\sqrt{9 \\times 20} = \\sqrt{9} \\times \\sqrt{20} = 3\\sqrt{20}$.\n\nBut we can still break down $\\sqrt{20}$ further, because that's like $4 \\times 5$, sooo...\n\n$\\sqrt{180} = 3 \\sqrt{4 \\times 5} = 3 \\sqrt{4} \\times \\sqrt{5} = 3 \\cdot 2 \\sqrt{5} = 6\\sqrt{5}$\n\nWait, no 😕... still not $\\sqrt{3}$. I’ll try one more time...\n\n$180 = 36 \\times 5$, but $36 = 6^2$ and if I dig a bit further, I can split that $5$ as $4 \\times \\frac{5}{4}$ right?\n\nThen, $\\sqrt{180} = \\sqrt{36 \\times \\cdot \\frac{5}{4}} = \\sqrt{36} \\times \\sqrt{4} \\times \\sqrt{\\frac{5}{4}}$. That’d be $6 \\times 2 \\times \\sqrt{\\frac{5}{4}}$. No, nope, not $\\sqrt{3}$ again. Ahh this is frustrating.\n\nOh wait! I think I've got it now!! We just need to keep it as is after factoring out 36.\n\nSo, $\\sqrt{180} = \\sqrt{36 \\times 5} = \\sqrt{36} \\times \\sqrt{5} = 6\\sqrt{5}$ there", "Alright, so I'm looking for a perfect square that's a factor of 180 and has a 3 in it. Let's break down 180 again.\n\nSince $180 = 36 \\times 5$ and $36$ is a perfect square ($6^2$), let's see the other factor 5. I had it wrong before. Hm, $180 = 2 \\times 2 \\times 3 \\times 3 \\times 5$. So if I pair up the $2's$ and $3's$, oh wait, I'm seeing it now! It's \n\n$180 = (2 \\times 3)^2 \\times 5 = 6^2 \\times 5 = 36 \\times 5$\n\nand now if I pair up the square of 6 with one of those 3's, it becomes like \n\n$180 = 6^2 \\times 3 \\times 5 = (6 \\times 3)^2 \\times \\frac{5}{3}$\n\nThat's a square of $6 \\times 3$ which is 18, and I've got the 5 left which needs to be divided by 3 as well to make it all square to pull it out of the radical. So it's like\n\n$180 = (6 \\times 3)^2 \\times \\frac{5}{3}$ and now I can take square roots properly:\n\n$\\sqrt{180} = \\sqrt{(6 \\times 3)^2 \\times \\frac{5}{3}} = 6 \\times 3 \\times \\sqrt{\\frac{5}{3}} = 18 \\times \\sqrt{\\frac{5}{3}}$\n\nHold on, still not there yet... I should get that $\\sqrt{3}$ 🤔...\n\nOkay, so I go back to\n\n$180 = 6^2 \\times 5 = 36 \\times 5$ \n\nand instead I can say \n\n$ 180 = 6^2 \\times 3 \\times \\frac{5}{3} = (6\\times\\sqrt{3})^2$\n\nbecause $6^2$ times 3 (which is $36 \\times 3$) makes 108, and $108 \\times \\frac{5}{3}$ equals 180! So we end up with \n\n$\\sqrt{180} = 6 \\times \\", "Oh, now I see where I was going wrong. Thanks for the help! So now we're back to finding $d(B,AC)$, and we have the correct length of AB, which we've just found to be $AB = 6\\sqrt{3}$ cm.\n\nWe already found the area $A$ of the triangle to be $36$ cm$^2$ using $d(C, AB)=AC=6$ cm and $BC=12$ cm as the base and height respectively, so the area can be calculated using any base-height pair:\n\n$A = \\frac{1}{2} \\cdot base \\cdot height$\n\nNow using AC as the base and $d(B, AC)$ as the height, we get:\n\n$36 = \\frac{1}{2} \\cdot AC \\cdot d(B, AC)$\n$36 = \\frac{1}{2} \\cdot 6 cm \\cdot d(B, AC)$\n$36 = 3 cm \\cdot d(B, AC)$\n\nDividing both sides by 3 cm, we should get:\n\n$d(B, AC) = \\frac{36}{3} cm$\n$d(B, AC) = 12 cm$\n\nWait, looks like I did the same mistake again. Since we're looking for $d(B,AC)$ and expecting something with $\\sqrt{3}$ in it, I should probably use the length of AB and the Area to get it right.\n\nSo, we should technically use $AB$ and the area to find the actual height which is $d(B, AC)$. Let me correct my approach using the other formula, $A = \\frac{1}{2} \\cdot AB \\cdot d(B, AC)$:\n\n$36 cm^2 = \\frac{1}{2} \\cdot 6\\sqrt{3} cm \\cdot d(B, AC)$\n\nNow multiply both sides by 2:\n\n$72 cm^2 = 6\\sqrt{3} cm \\cdot d(B, AC)$\n\nNow I’ll divide both sides by $6\\sqrt{3} cm$ to solve for $d(B, AC)$:\n\n$d(B, AC) = \\frac{72}{6\\sqrt{3}} cm$\n$d(B, AC) = \\frac{72}{6\\sqrt{3}} \\cdot \\frac{\\sqrt{3}}{\\sqrt{3}} cm$ (multiplying by", "Oops, almost! Let’s simplify this step by step:\n\n$\\frac{72\\sqrt{3}}{18} = 4\\sqrt{3}$\n\nSo, the distance $d(B, AC)$, which is the height of the triangle when using $AC$ as the base, is $4\\sqrt{3}$ cm. \n\nBut that's not what the question asked us to show. It said it should be $6\\sqrt{3}$. I think I made a mistake in the simplification. The 72 should divide evenly by 18 since $72 = 4 \\times 18$, but it looks like I multiplied instead of dividing. Let's correct that last mistake:\n\n$72\\sqrt{3} /18 = \\frac{72}{18} \\cdot \\sqrt{3}$\n\nWhen we divide 72 by 18, we get 4. So this simplifies to:\n\n$4\\sqrt{3}$\n\nThat's the distance from B to the line AC. Hm, seems like I'm making a basic arithmetic mistake. 😓\n\nI'm supposed to show that $d(B,AC) = 6\\sqrt{3}$. What did I miss this time?", "Right, I gotta isolate $d(B, AC)$. My bad on the confusion. So, starting from:\n\n$72 = 6\\sqrt{3} \\cdot d(B, AC)$\n\nTo isolate $d(B, AC)$, I’ll divide both sides by $6\\sqrt{3}$ like this:\n\n$d(B, AC) = \\frac{72}{6\\sqrt{3}}$\n\nSimplify that by dividing 72 by 6:\n\n$d(B, AC) = \\frac{72}{6} \\cdot \\frac{1}{\\sqrt{3}}$\n\nWe get:\n\n$d(B, AC) = 12 \\cdot \\frac{1}{\\sqrt{3}}$\n\nTo rationalize the denominator, I’ll multiply the numerator and the denominator by $\\sqrt{3}$:\n\n$d(B, AC) = \\frac{12}{\\sqrt{3}} \\cdot \\frac{\\sqrt{3}}{\\sqrt{3}}$\n\nThat simplifies to:\n\n$d(B, AC) = \\frac{12\\sqrt{3}}{3}$\n\nAnd then, divide 12 by 3:\n\n$d(B, AC) = 4\\sqrt{3}$\n\nThat's the correct calculation now. It looks like no matter what I do, I’m getting $d(B, AC) = 4\\sqrt{3}$, which is different from what’s given in the problem. The problem statement says it should be $6\\sqrt{3}$.\n\nWait a second, maybe I made a mistake with the area calculation before and didn’t actually need to use AB to find $d(B, AC)$... Am I using the right formula for the area of triangle ABC when I solve for $d(B, AC)$? If AC is the base, the height would have to be part of it... Oh, I think I might see it now! We should have used BC instead of AB in the formula.\n\nLet's use the formula one more time, but now correctly:\n\n$Area = \\frac{1}{2} \\cdot base \\cdot height$\n\nUsing BC as base, we have AC as the height; then with AC as base, BC is the height. Since we know one area calculation led to $d(C, AB)$ being equal to AC = 6 cm, let's try with $d(B, AC)$:\n\n$36 cm^2 = \\frac{1}{2} \\cdot BC", "Aha, I'm starting to remember now! We've got triangle ABC with the right angle at A. This means that AB, the hypotenuse, isn’t just any side but actually the longest side of the triangle. So, in terms of using it to find an area, we definitely should know something about it. \n\nBut for the question, we're trying to find the distance $d(B, AC)$ from B to the line along AC. So AC is still the base in this case and $d(B, AC)$ is the height, and we have been using this relationship to find $d(B, AC)$ given the area that we calculated using BC as the base and AC (or $d(C, AB)$) as the height.\n\nSo using AC as the base and the fact that ABC is a right-angled triangle at A (so BC is perpendicular to AC), we got the triangle's area as $A = 36 \\text{ cm}^2$. To find $d(B, AC)$, the height with respect to AC, we use:\n\n$$ 36 \\text{ cm}^2 = \\frac{1}{2} \\cdot AC \\cdot d(B, AC) $$\n\nWe already know AC is 6 cm, so plug that in:\n\n$$ 36 \\text{ cm}^2 = \\frac{1}{2} \\cdot 6 \\text{ cm} \\cdot d(B, AC) $$\n$$ 72 \\text{ cm}^2 = 6 \\text{ cm} \\cdot d(B, AC) $$\n$$ d(B, AC) = \\frac{72}{6} \\text{ cm} $$\n$$ d(B, AC) = 12 \\text{ cm} $$\n\nThat's the height when AC is the base, and yes, it does not match with the problem statement which claims it should be $6\\sqrt{3}$. We had a confusion with the AB calculation earlier. But when we consider the triangle ABC where A is the right angle, using AC (6 cm) as the base and the height as AB (which is now correctly $6\\sqrt{3})$ will give a different area calculation than what we have for A.\n\nSince $BC = 12$ cm is the longest side and also the base in our initial area setup, the height we found perpendicular to it was $AC = 6$ cm.", "Yes, that's exactly right! The other leg of the triangle, AB, which I incorrectly calculated as $6\\sqrt{5}$ before, is actually the height of the triangle when using AC as the base. Since $AB$ is the other leg, it is perpendicular to AC, and that gives us the height – or the distance from B to the line AC, which is $d(B, AC)$.\n\nSo, the correct calculation for the length of AB that we had earlier:\n\n$$AB = 6\\sqrt{3}$$\n\nGiven that AC is perpendicular to BC at point A, this makes $d(B, AC)$ equal to the length of AB, because AB is perpendicular to AC by definition of a right triangle at A. This means the distance from point B to line AC is just the length of AB:\n\n$$d(B, AC) = AB = 6\\sqrt{3} \\text{ cm}$$\n\nSo the distance $d(B, AC)$ is the same length as AB, which matches the required statement in the problem. I overcomplicated things earlier, but now we've got it straightened out. Thanks for guiding me through!"], "tutor": ["Hello! I am your tutor. Can you walk me through your solution?", "That's quite alright! You're on the right track with the distances. Let's think about which parts of the triangle we are dealing with. Since ABC is a right-angled triangle at A, and you already identified AC and BC, what does that imply about the line segment AB in relation to point C? What's special about a right angle in terms of distances from points to lines?", "Exactly, you've got it! The line segment AC is perpendicular to AB at point A, making it the shortest distance from point C to line AB. Therefore, $d(C, AB)$ is indeed the length of AC, which you correctly identified as 6 cm. Well done!\n\nNow, how about finding $d(B, AC)$? Remember that this is the distance from point B to the line AC. Can you think of a way to use the information you already have about the triangle to find this distance?", "You are thinking along the right lines! The distance you're seeking, $d(B, AC)$, would indeed be the height of the triangle when considering AC as the base.\n\nSince you're considering using the area formula, let's go over it together; the area $A$ of the triangle can be expressed as follows when using base AC:\n\n$A = \\frac{1}{2} \\cdot \\text{base} \\cdot \\text{height} = \\frac{1}{2} \\cdot AC \\cdot d(B, AC)$\n\nTo find $A$, you indeed could find the length of the hypotenuse AB first. Could you remind me how the Pythagorean theorem might help in finding the length of AB? And once you have that, we'll look at different ways to calculate the area.", "You’re absolutely on the right track! Yes, you can use either pair of corresponding base and height to find the area of the triangle. You have used $d(C, AB)$ as the height and BC as the base to find the area, and you've correctly calculated the area of the triangle to be 36 cm$^2$.\n\nNow, because $ A = \\frac{1}{2} \\times AC \\times d(B, AC) $, and you’re given $ A = 36 $ cm$^2$ and $ AC = 6 $ cm, you can solve for $ d(B, AC) $. What do you get when you calculate $ d(B, AC) $ using these values? Remember, you're solving for the height with respect to the base AC.", "You're very close, and your method is correct. However, let's revisit the value of AB that you initially calculated using the Pythagorean theorem. Recall that you had calculated:\n\n$AB^2 = AC^2 + BC^2$\n\nAfter substituting AC and BC, you calculated:\n\n$AB^2 = 6^2 + 12^2 = 36 + 144 = 180$\n\nThe small oversight is in the simplification of the square root of 180. Can we simplify that together accurately? What is the square root of 180 when simplified?", "Great effort! You're exploring this really thoroughly, and it's great to see you persevering. It looks like there was a little mix-up in the simplification process. Let's think about the number 180 and the factors we're seeking. \n\nNow, we want to find a factor of 180 that's a perfect square and has 3 as a factor. The number 36 you've used is correct since 180 is divisible by 36. But let's reconsider the other factor we get when we divide 180 by 36. Could you try breaking down the number 180 again, looking specifically for a factor that involves 3?", "Excellent! You are so close. Let’s complete that thought. When you’ve decomposed 180 as $6^2 \\times 3$, you can write it out as:\n\n$180 = 6^2 \\times 3 = 36 \\times 3$\n\nAnd taking the square root:\n\n$\\sqrt{180} = \\sqrt{36 \\times 3} = \\sqrt{36} \\times \\sqrt{3} = 6 \\times \\sqrt{3}$\n\nThere we have it, the correct simplification of $\\sqrt{180}$! Now that we have the correct length of AB, we can address the initial question you had—calculating $d(B, AC)$. \n\nSince the area is consistent regardless of which sides we designate as base and height, how can you now use the area equation, with the proper length of AB, to find $d(B, AC)$?", "You're applying the concepts correctly now! By multiplying by $\\frac{\\sqrt{3}}{\\sqrt{3}}$, you are using the technique of rationalizing the denominator. Let's carry out that multiplication and solve for $d(B, AC)$.\n\n$\\frac{72}{6\\sqrt{3}} \\cdot \\frac{\\sqrt{3}}{\\sqrt{3}} = \\frac{72\\sqrt{3}}{6 \\cdot 3}$\n\nNow, simplify the expression.\n\n$\\frac{72\\sqrt{3}}{18} = \\frac{4}{1}\\sqrt{3}$ \n\nWhat does that simplify to?", "That's okay, arithmetic mistakes happen to everyone! Let's just do the division one more time to ensure we've got it right. You already have:\n\n$72\\sqrt{3} /18$\n\nThis simplifies as you divide 72 by 18, as you identified:\n\n$\\frac{72}{18} = 4$\n\nSo when you carry out that division, you get:\n\n$4\\sqrt{3}$\n\nHowever, earlier, you've got the initial part correct but let's revisit the final simplification: \n\n$d(B, AC) = \\frac{72\\sqrt{3}}{18} = 4\\sqrt{3}$\n\nThis is the result for $d(B, AC)$ you've obtained after simplification. However, this does not match what's required according to the problem statement. In the problem statement, it is mentioned that $d(B,AC) = 6\\sqrt{3}$.\n\nLet’s make sure we did not miss any factors. Can you check if the computation of the distance uses the correct formula and the area is substituted correctly? Let's go over your calculations once more for $d(B, AC)$. Remember we arranged for:\n\n$A = \\frac{1}{2} \\cdot AB \\cdot d(B, AC)$\n\nWith the given area $A = 36$ cm$^2$ and the calculated length of $AB = 6\\sqrt{3}$ cm. Let’s rework the following step patiently:\n\n$72 = 6\\sqrt{3} \\cdot d(B, AC)$\n\nNow think carefully, how would you isolate $d(B, AC)$ in this equation?", "Your revelation is spot on! You do not need to calculate AB again to find the distance $d(B, AC)$ because you have all the necessary information from the previous area calculation.\n\nWith the formula for the area of a triangle:\n$$ A = \\frac{1}{2} \\cdot \\text{base} \\cdot \\text{height} $$\n\nAnd knowing that $A = 36$ cm$^2$ and BC is the base when finding $d(B, AC)$, which is the height, you can rework the equation with BC and AC. \n\nSince the base BC = 12 cm and the height with respect to that base is the distance from the vertex opposite to the base, which for BC is $d(C, AB)$ and is 6 cm, let's plug these in:\n\n$$ A = \\frac{1}{2} \\cdot BC \\cdot d(C, AB) $$\n$$ 36 = \\frac{1}{2} \\cdot 12 \\cdot 6 $$\n\nThis equation is true from your previous calculations, confirming that the area is correct. Therefore, the other height (distance) $d(B, AC)$ can be calculated by using AC as the base:\n\n$$ A = \\frac{1}{2} \\cdot AC \\cdot d(B, AC) $$\n\nNow solve for $d(B, AC)$ with AC = 6 cm and A = 36 cm$^2$:\n\n$$ 36 = \\frac{1}{2} \\cdot 6 \\cdot d(B, AC) $$\n$$ 72 = 6 \\cdot d(B, AC) $$\n$$ d(B, AC) = \\frac{72}{6} $$\n$$ d(B, AC) = 12 $$\n\nBut we knew from the beginning that $d(B, AC)$ should have a square root of 3 in it, and since there isn't one in 12, let's consider what kind of unit we would need for it to have that square root of 3. We know AB has that square root of 3 we're looking for. Here's something to think about: When you were working with the Pythagorean theorem, if you set BC to be the base and AC to be the perpendicular height, what does that imply about AB in relation to these two segments?\n\nLet's look again at the triangle and remember that when the right triangle has a right angle at", "That's right, the relationship between the sides is key here. If you have a right angle at A, with AC as one leg and BC as the other, then the right angle tells you something important about how these sides relate to $d(C, AB)$ and $d(B, AC)$.\n\nFor $d(C, AB)$, because angle A is the right angle, the line segment from C to AB is just AC itself, which is why $d(C, AB) = 6$ cm.\n\nNow, when we want to find $d(B, AC)$, which is the height of the triangle when using AC as the base, we simply look at the other leg of the right triangle, AB. Here's the key: Since AC is perpendicular to BC at point A, B lies on BC and AC is perpendicular to AB at point A. Therefore, the height of the triangle from B perpendicular to AC, or $d(B, AC)$, is the other leg of the triangle, which is AB.\n\nYou already used the Pythagorean theorem correctly earlier to find AB:\n\n$$AB^2 = AC^2 + BC^2 = 6^2 + 12^2 = 36 + 144 = 180$$\n\n$$AB = \\sqrt{180} = \\sqrt{36 \\times 5} = \\sqrt{36} \\times \\sqrt{5} = 6\\sqrt{5}$$\n\nUsing this calculation for AB, you noted something important about the area of the triangle:\n\n$$ A = \\frac{1}{2} \\cdot base \\cdot height$$\n\nThis formula can be rewritten as:\n\n$$ A = \\frac{1}{2} \\cdot AC \\cdot AB$$\n\nSince we know the area is 36 cm$^2$ and AC (our base) is 6 cm, let's solve for AB:\n\n$$ 36 = \\frac{1}{2} \\cdot 6 \\cdot AB$$\n$$ 72 = 6 \\cdot AB$$\n$$ AB = \\frac{72}{6}$$\n$$ AB = 12 \\text{ cm}$$\n\nNow, it all comes together. If $AB = 12$ cm and when using AC as the base, the height $d(B, AC)$ is actually the length of AB. So with AC as the base, the height, or $d(B, AC)$, is AB,", "You're very welcome! I'm glad you figured it out. Yes, for a right-angled triangle, the side opposite the right angle is the hypotenuse, and the lengths from the other two vertices to the lines containing the opposite sides are just the lengths of the sides themselves (one of which is the other leg of the triangle). \n\nJust to sum up what you've worked through:\n\n- $d(C, AB)$ is the distance from point C to line AB, which is the same as AC because AC is perpendicular to AB at A. So, $d(C, AB) = AC = 6$ cm.\n  \n- $d(B, AC)$ is the distance from point B to line AC, which is the same as AB because AB is perpendicular to AC at A. After a correct calculation, $d(B, AC) = AB = 6\\sqrt{3}$ cm.\n\nYour persistence in working through the problem step by step and checking your work led to the correct solutions. Well done! If you have any more questions or another topic to explore, feel free to ask."], "intents": [[], [], [], [], [], [], [], [], [], [], [], []], "assessments": [[], [], [], [], [], [], [], [], [], [], [], []], "total_cost": 2.43687, "pb": "Let ABC be a right-angled triangle at A with AC=6cm and BC=12cm. Determine d(C,AB) the distance from C to the line (AB) and show that d(B,AC), the distance from B to the line (AC) is equal to $6*\\sqrt(3)$", "sol": "ABC is a right-angled triangle at A so the hypothenuse is BC. \nFirst, d(C,AB)=AC=6cm (orthogonal projection).\nBy the Pythagorean theorem, $BC^2 = AB^2 + AC^2$ so $AB^2 = BC^2 - AC^2$.\nWe compute $AB^2 = BC^2-AC^2 = 12^2 - 6^2 = 144 - 36 = 108$\nSince (AB) is perpendiculat to (AC), A is the orthogonal projection of B on (AC), so d(B,AC) = AB.\nThus, $d(B,AC) = AB = \\sqrt(108) = \\sqrt(6^2*3) = 6*sqrt(3)$"}